In [1]:
import pymysql
import pandas as pd
import numpy as np

In [2]:
mydb = pymysql.connect('localhost','airloki','lsz1365978','testdb')
cursor = mydb.cursor()

In [3]:
sql01 = """create table employee (
        first_name char(20) not null,
        last_name char(20),
        age int,
        sex char(1),
        income float );"""

In [4]:
cursor.execute('drop table if exists employee')
cursor.execute(sql01)

0

In [5]:
cursor.execute("SELECT VERSION()")
data = cursor.fetchone()
print(data)

('5.7.20-log',)

In [6]:
sql02 = """insert into employee(
           first_name,last_name,age,sex,income)
           values('Bingbing','Li',30,'M',16000)
"""

In [7]:
try:
    cursor.execute(sql02)
    mydb.commit()
except:
    mydb.rollback()

In [8]:
sql03 = """select * from employee"""

In [24]:
try:
    p_resultDB = pd.DataFrame()
    cursor.execute(sql03)
    results = cursor.fetchall()
    i = 0
    for row in results:
        p_resultDB[i] = row
        i += 1
except:
    print('error')

In [25]:
pd.DataFrame(np.array(results))

          0      1   2  3        4
0  Bingbing     Li  30  M  16000.0
1      Mari  Marid  30  F  20000.0
2     Keone  Marid  30  M  20000.0
3      Mari  Marid  30  F  20000.0
4     Keone  Marid  30  M  20000.0

In [12]:
resultDB = p_resultDB.T
resultDB.columns = ['fn','ln','age','sex','income']

In [13]:
resultDB

         fn  ln age sex income
0  Bingbing  Li  30   M  16000

In [14]:
sql04 = "update employee set income = 10000 where first_name ='May_J'"

In [15]:
try:
    cursor.execute(sql04)
    mydb.commit()
except:
    mydb.rollback()

In [16]:
sql05 = "delete from employee where income = 10000"

In [17]:
try:
    cursor.execute(sql05)
    mydb.commit()
except:
    mydb.rollback()

In [23]:
sql06 = "insert into employee(first_name,last_name,age,sex,income) values(%s, %s, %s,%s,%s)"
tmp = [('Mari','Marid','30','F','20000'),('Keone','Marid','30','M','20000')]
cursor.executemany(sql06,tmp)
mydb.commit()